# DATA 202 - Module 2: Data Management with Pandas
* Instructor: Dr. Josh Fagan
* [Jupyter Notebook Tips and Tricks](http://bit.ly/34embJh)
* [Markdown Cheatsheet](http://bit.ly/2UkNVXV)
* Magic command to list all variables: `%whos`

### Instructions

Welcome to the second assignment of DATA 202. This assignment is meant to help you review/familiarize yourself with indexing, combining, and working with data types in Pandas.

To receive credit for a assignment, answer all questions correctly and submit before the deadline listed on Canvas.

---
### Collaboration Policy

Data science is a collaborative activity. While you may talk with others about the labs, we ask that you **write your solutions individually**. If you do discuss the assignments with others please **include their names** below.

**Collaborators**: *list collaborators here*
* Jessi Hudgins
* Y

---
## Exercises

To answer all of the exercises you will need to import the pandas package. Please do that below.

In [1]:
import pandas as pd

### Exercise 1 - Loading and Basic Exploration

Load the `business_flights.csv` and `economy_flights.csv` datasets into two separate Panda's DataFrames called `business` and `economy`, respectively.

Include appropriate arguments to have `date` stored as a `datetime`. 

**NOTE:** This will likely produce a bunch of red highlighted text, but they are just warnings and you can ignore them.

In [2]:
business = pd.read_csv('business_flights.csv', parse_dates=['date'])
economy = pd.read_csv('economy_flights.csv', parse_dates=['date'])

/var/folders/4m/qvc8ly2d0mz07rthdgkms0tc0000gn/T/ipykernel_64436/991244262.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  business = pd.read_csv('business_flights.csv', parse_dates=['date'])
/var/folders/4m/qvc8ly2d0mz07rthdgkms0tc0000gn/T/ipykernel_64436/991244262.py:2: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  economy = pd.read_csv('economy_flights.csv', parse_dates=['date'])

Display the first 5 rows of `business`.

In [3]:
business.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,2022-11-02,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612"
1,2022-11-02,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612"
2,2022-11-02,Air India,AI,531,20:00,Delhi,24h 45m,1-stop,20:45,Mumbai,"42,220"
3,2022-11-02,Air India,AI,839,21:25,Delhi,26h 30m,1-stop,23:55,Mumbai,"44,450"
4,2022-11-02,Air India,AI,544,17:15,Delhi,06h 40m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,23:55,Mumbai,"46,690"

Display the first 5 rows of `economy`.

In [4]:
economy.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,2022-11-02,SpiceJet,SG,8709,18:55,Delhi,02h 10m,non-stop,21:05,Mumbai,"5,953"
1,2022-11-02,SpiceJet,SG,8157,06:20,Delhi,02h 20m,non-stop,08:40,Mumbai,"5,953"
2,2022-11-02,AirAsia,I5,764,04:25,Delhi,02h 10m,non-stop,06:35,Mumbai,"5,956"
3,2022-11-02,Vistara,UK,995,10:20,Delhi,02h 15m,non-stop,12:35,Mumbai,"5,955"
4,2022-11-02,Vistara,UK,963,08:50,Delhi,02h 20m,non-stop,11:10,Mumbai,"5,955"

#### Exercise 1 Grading Notes

Grade:

10/10

### Exercise 2 - Join Feature to Data Sets

Run the next two cells below without changes to create two new DataFrames which contain an extra feature of information for each DataFrame, `business` and `economy`.

In [5]:
class_business = pd.DataFrame(business.airline)
class_business['class'] = 'business'
class_business.head()

     airline     class
0  Air India  business
1  Air India  business
2  Air India  business
3  Air India  business
4  Air India  business

In [6]:
class_economy = pd.DataFrame(economy.airline)
class_economy['class'] = 'economy'
class_economy.head()

    airline    class
0  SpiceJet  economy
1  SpiceJet  economy
2   AirAsia  economy
3   Vistara  economy
4   Vistara  economy

Use the `join` function to combine the `business` DataFrame and the `class_business` DataFrame. Handle column conflicts with a right suffix of `_dup`. 

Overrite the `business` DataFrame with the combined DataFrame.

Display the first 5 rows of the new DataFrame to confirm changes.

In [7]:
combined_dataframes = business.join(class_business, rsuffix='_dup')

business = combined_dataframes 
business.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,airline_dup,class
0,2022-11-02,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612",Air India,business
1,2022-11-02,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612",Air India,business
2,2022-11-02,Air India,AI,531,20:00,Delhi,24h 45m,1-stop,20:45,Mumbai,"42,220",Air India,business
3,2022-11-02,Air India,AI,839,21:25,Delhi,26h 30m,1-stop,23:55,Mumbai,"44,450",Air India,business
4,2022-11-02,Air India,AI,544,17:15,Delhi,06h 40m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,23:55,Mumbai,"46,690",Air India,business

Use the `join` function to combine the `economy` DataFrame and the `class_economy` DataFrame. Handle column conflicts with a right suffix of `_dup`. 

Overrite the `economy` DataFrame with the combined DataFrame.

Display the first 5 rows of the new DataFrame to confirm changes.

In [8]:
combined_dataframes = economy.join(class_economy, rsuffix='_dup')

economy = combined_dataframes 
economy.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,airline_dup,class
0,2022-11-02,SpiceJet,SG,8709,18:55,Delhi,02h 10m,non-stop,21:05,Mumbai,"5,953",SpiceJet,economy
1,2022-11-02,SpiceJet,SG,8157,06:20,Delhi,02h 20m,non-stop,08:40,Mumbai,"5,953",SpiceJet,economy
2,2022-11-02,AirAsia,I5,764,04:25,Delhi,02h 10m,non-stop,06:35,Mumbai,"5,956",AirAsia,economy
3,2022-11-02,Vistara,UK,995,10:20,Delhi,02h 15m,non-stop,12:35,Mumbai,"5,955",Vistara,economy
4,2022-11-02,Vistara,UK,963,08:50,Delhi,02h 20m,non-stop,11:10,Mumbai,"5,955",Vistara,economy

#### Exercise 2 Grading Notes

Grade:

18/18

### Exercise 3 - Combine Economy and Business

Concatinate the `business` and `economy` DataFrames. Store the result in a DataFrame called `flights`.

Print the shape of `business`, `economy` and `flights` to do a sanity check.

In [9]:
flights = pd.concat([business, economy])

print(business.shape)
print(economy.shape)
print(flights.shape)

(93487, 13)
(206774, 13)
(300261, 13)

#### Exercise 3 Grading Notes

Grade:

18/18

### Exercise 4 - Explore Data Types

Using one pandas command, display the data types of each column in `flights`.

In [10]:
print(flights.dtypes)

date           datetime64[ns]
airline                object
ch_code                object
num_code                int64
dep_time               object
from                   object
time_taken             object
stop                   object
arr_time               object
to                     object
price                  object
airline_dup            object
class                  object
dtype: object

Cast `num_code` as a string. 

**NOTEs:**
- Be sure to overrite the old column so the change is made to the `flights` DataFrame.
- Display the data types again to make sure the changes took place

In [11]:
flights.num_code = flights.num_code.astype(str)

print(flights.dtypes)

date           datetime64[ns]
airline                object
ch_code                object
num_code               object
dep_time               object
from                   object
time_taken             object
stop                   object
arr_time               object
to                     object
price                  object
airline_dup            object
class                  object
dtype: object

#### Exercise 4 Grading Notes

Grade:

18/18

### Exercise 5 - Explore Day of Week

Find what day of the week each flight occured on. Add `.value_counts()` to your line of code to get a break down of number of flights per day of the week.

In [12]:
flights.date.dt.day_name().value_counts()

Monday       50508
Thursday     50395
Sunday       48984
Wednesday    39664
Saturday     37734
Tuesday      37328
Friday       35648
Name: date, dtype: int64

#### Exercise 5 Grading Notes

Grade:

18/18

### Exercise 6 - Indexing

Using `.loc[]` return the 50th row of the `num_code` column in `flights`

In [13]:
row = flights.loc[49, 'num_code']
print(row)

49     955
49    9643
Name: num_code, dtype: object

Are there any surprises? Why?

In [14]:
# Returns all corresponding values in the ‘num_code’ column which could lead to multiple flights returning 
# There were two values that printed out suggesting there is duplicate index values in this data frame.

Using `.iloc[]` return the 50th row of the `num_code` column in `flights`

**Note:** Remember indexing starts at 0

In [15]:
row = flights.iloc[49, flights.columns.get_loc('num_code')]
print(row)

955

Are there any surprises? Why?

In [16]:
# Only one value was returned, which is surprising since using .loc returned two

#### Exercise 6 Grading Notes

Grade:

18/18

---
## Submission

Make sure you have run all cells in your notebook in order before running the cell below, so that all images/graphs appear in the output. I recommend going to the "Kernel" menu at the top and selecting "Restart & Run All". This will ensure that everything runs correctly when it is run sequentially.

## Final Grade
100/100